#!/usr/bin/env python3
# -*- coding: utf-8 -*-


# Сколько можно купить быков, коров и телят, платя за быка 10 р.,
# за корову - 5 р., а за теленка - 0,5 р., если на 100 р. надо купить
# 100 голов скота?


if __name__ == "__main__":
    for i in range(11):
        for j in range(21):
            for k in range(201):
                if i * 10 + j * 5 + k * 0.5 == 100 and i + j + k == 100:
                    print("│ Количество быков │ Количество коров │ Количество телят │")
                    print("├──────────────────┼──────────────────┼──────────────────┤")
                    print(f"│ {i:^16} │ {j:^16} │ {k:^16} │")
                    exit(0)
